Revit 2026 API

# CorrectionFactorSet Methods

---

The CorrectionFactorSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every correction factor from the set, rendering it empty. |
|  | Contains |  |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | Erase |  |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Insert |  |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

CorrectionFactorSet Class

Autodesk.Revit.DB.Electrical Namespace